IdeaRS.Connections
BeamSegmentStubData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.BeamSegmentStubData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.BeamSegmentStubData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class BeamSegmentStubData : ConnectionCmdData,
	IBoltableData
The BeamSegmentStubData type exposes the following members.
Constructors
Name | Description
BeamSegmentStubData
Initializes a new instance of the BeamSegmentStubData class
Top
Properties
Name | Description
CrossSectionType
EccentricityBeginY
 Gets or sets the local eccentricity Y at the begin of the stub
EccentricityBeginZ
 Gets or sets the local eccentricity Z at the begin of the stub
ExplodeToPlates
Fastening
InclinationBottom
InclinationLeft
InclinationRight
InclinationTop
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Plate2Plate
ProfileType
StubPltThickness
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace